[
  {
    "id": 1,
    "title": "Leia o trecho do conto:\n\n\"Maria caminhava pela rua silenciosa, observando as vitrines iluminadas. Cada reflexo no vidro parecia contar uma história diferente, enquanto o vento frio da noite fazia os cabelos dançarem sobre o rosto.\" \n\nQual figura de linguagem predomina neste trecho?",
    "alternatives": [
      {"letter": "A", "text": "Metáfora"},
      {"letter": "B", "text": "Personificação"},
      {"letter": "C", "text": "Hipérbole"},
      {"letter": "D", "text": "Comparação"}
    ],
    "correctAlternative": "B",
    "hint": "A personificação ocorre quando objetos, animais ou elementos da natureza recebem características humanas. No trecho, o vento 'faz os cabelos dançarem' e os reflexos 'pareciam contar histórias'. Isso é típico da personificação, pois atribui ações humanas a elementos inanimados."
  },
  {
    "id": 2,
    "title": "Leia o poema:\n\n\"O mar sussurra segredos,\nAs ondas dançam na areia,\nO céu observa atento\nCada passo que você dá.\" \n\nQual recurso de linguagem está presente em 'O mar sussurra segredos'?",
    "alternatives": [
      {"letter": "A", "text": "Prosopopeia"},
      {"letter": "B", "text": "Metáfora"},
      {"letter": "C", "text": "Aliteração"},
      {"letter": "D", "text": "Hipérbole"}
    ],
    "correctAlternative": "A",
    "hint": "A prosopopeia, ou personificação, é quando seres inanimados ou elementos da natureza recebem características humanas. O mar 'sussurra' e as ondas 'dançam', ações humanas atribuídas a elementos naturais. Essa figura é muito comum em poemas e literatura para criar imagens vivas."
  },
  {
    "id": 3,
    "title": "Leia o texto jornalístico:\n\n\"O município registrou um aumento de 20% no número de bicicletas circulando nas ruas após a implementação do programa de ciclovias.\" \n\nQual é a função predominante da linguagem neste texto?",
    "alternatives": [
      {"letter": "A", "text": "Emotiva"},
      {"letter": "B", "text": "Referencial"},
      {"letter": "C", "text": "Conativa"},
      {"letter": "D", "text": "Metalinguística"}
    ],
    "correctAlternative": "B",
    "hint": "A função referencial da linguagem tem como objetivo transmitir informações objetivas sobre fatos ou acontecimentos. Neste texto, o objetivo é informar o leitor sobre dados reais e resultados de um programa de ciclovias, sem apelar para emoções ou persuadir o leitor."
  },
  {
    "id": 4,
    "title": "Leia o trecho de uma propaganda:\n\n\"Compre já o novo smartphone X! Câmera profissional, bateria que dura o dia todo e design elegante. Não perca essa oportunidade!\" \n\nQual é a função predominante da linguagem?",
    "alternatives": [
      {"letter": "A", "text": "Referencial"},
      {"letter": "B", "text": "Conativa (ou apelativa)"},
      {"letter": "C", "text": "Emotiva"},
      {"letter": "D", "text": "Poética"}
    ],
    "correctAlternative": "B",
    "hint": "A função conativa ou apelativa é usada quando o emissor busca influenciar o comportamento do receptor. Propagandas geralmente usam essa função para convencer o leitor a agir, como comprar um produto ou serviço. Observe os comandos: 'Compre já' e 'Não perca a oportunidade'."
  },
  {
    "id": 5,
    "title": "Leia o trecho narrativo:\n\n\"João olhou para o céu cinzento e suspirou. A chuva caía fina, quase invisível, e ele sentia que aquele dia duraria para sempre.\" \n\nA expressão 'sentia que aquele dia duraria para sempre' é um exemplo de:",
    "alternatives": [
      {"letter": "A", "text": "Hipérbole"},
      {"letter": "B", "text": "Metáfora"},
      {"letter": "C", "text": "Personificação"},
      {"letter": "D", "text": "Ironia"}
    ],
    "correctAlternative": "A",
    "hint": "A hipérbole é um exagero intencional para enfatizar algo. Aqui, 'o dia duraria para sempre' exagera a sensação de lentidão ou tédio de João, transmitindo a intensidade do momento. Hipérboles ajudam a expressar emoções ou impressões de maneira dramática."
  },
  {
    "id": 6,
    "title": "Leia a charge:\n\nUm desenho mostra um computador com fumaça saindo e uma pessoa ao lado dizendo: \"Acho que ele vai precisar de férias.\" \n\nQual figura de linguagem está presente na fala da pessoa?",
    "alternatives": [
      {"letter": "A", "text": "Ironia"},
      {"letter": "B", "text": "Metáfora"},
      {"letter": "C", "text": "Hipérbole"},
      {"letter": "D", "text": "Prosopopeia"}
    ],
    "correctAlternative": "A",
    "hint": "A ironia é um recurso em que se expressa o contrário do que se quer dizer, geralmente de forma humorística ou crítica. Aqui, a frase sugere que o computador 'precisa de férias', o que é impossível, ironizando a situação de superaquecimento ou problema técnico."
  },
  {
    "id": 7,
    "title": "Leia o poema:\n\n\"No jardim, flores cantam,\nO vento sussurra segredos,\nO sol sorri para todos.\" \n\nQue recurso de linguagem é predominante?",
    "alternatives": [
      {"letter": "A", "text": "Prosopopeia"},
      {"letter": "B", "text": "Metonímia"},
      {"letter": "C", "text": "Hipérbole"},
      {"letter": "D", "text": "Comparação"}
    ],
    "correctAlternative": "A",
    "hint": "Prosopopeia é usada para dar vida a elementos da natureza. As flores 'cantam', o vento 'sussurra' e o sol 'sorri'. Isso torna a leitura mais envolvente e poética, criando imagens vívidas que ajudam a transmitir sentimentos e atmosferas."
  },
  {
    "id": 8,
    "title": "Leia o trecho:\n\n\"Apesar de todos os obstáculos, Clara não desistiu do projeto e seguiu determinada até o fim.\" \n\nQual é o gênero textual predominante?",
    "alternatives": [
      {"letter": "A", "text": "Narrativo"},
      {"letter": "B", "text": "Dissertativo"},
      {"letter": "C", "text": "Instrucional"},
      {"letter": "D", "text": "Argumentativo"}
    ],
    "correctAlternative": "A",
    "hint": "O gênero narrativo conta uma história com personagens, ações e tempo. Aqui, o texto relata as ações de Clara e o desenvolvimento de um evento (o projeto), mesmo enfrentando dificuldades. Narrativas podem ser curtas ou longas, mas sempre contam algo em sequência."
  },
  {
    "id": 9,
    "title": "Leia o trecho publicitário:\n\n\"Não espere mais! Venha conhecer o incrível parque aquático e aproveite momentos de diversão para toda a família.\" \n\nQual função da linguagem predomina?",
    "alternatives": [
      {"letter": "A", "text": "Referencial"},
      {"letter": "B", "text": "Emotiva"},
      {"letter": "C", "text": "Conativa (ou apelativa)"},
      {"letter": "D", "text": "Poética"}
    ],
    "correctAlternative": "C",
    "hint": "A função conativa é usada para persuadir ou motivar o leitor. Neste anúncio, há uma tentativa de atrair o público para uma ação específica: visitar o parque aquático. Palavras como 'não espere mais' e 'aproveite' são chamadas à ação típicas desta função."
  },
  {
    "id": 10,
    "title": "Leia o trecho:\n\n\"O aluno abriu o livro e mergulhou nas páginas cheias de histórias e descobertas, enquanto o relógio parecia desacelerar para deixá-lo aproveitar cada palavra.\" \n\nA expressão 'o relógio parecia desacelerar' é um exemplo de:",
    "alternatives": [
      {"letter": "A", "text": "Metáfora"},
      {"letter": "B", "text": "Personificação"},
      {"letter": "C", "text": "Hipérbole"},
      {"letter": "D", "text": "Ironia"}
    ],
    "correctAlternative": "B",
    "hint": "A personificação atribui características humanas a objetos ou seres inanimados. Aqui, o relógio 'desacelera', ação típica de seres humanos, para mostrar a sensação de tempo que parece passar mais devagar durante a leitura."
  }
]
